Smart4J Framework学习/soap_spring_cxf_client/src/main/resources/wss4j_outbound_message.xml

<!-- SOAP 消息的加密和解密的响应 -->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                       soap:mustUnderstand="1">
            <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
                               Id="EK-eb7afb75-152f-4143-8eed-62933f7e32fc">
                <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
                <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    <wsse:SecurityTokenReference>
                        <ds:X509Data>
                            <ds:X509IssuerSerial>
                                <ds:X509IssuerName>CN=client</ds:X509IssuerName>
                                <ds:X509SerialNumber>1329393975</ds:X509SerialNumber>
                            </ds:X509IssuerSerial>
                        </ds:X509Data>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
                <xenc:CipherData>
                    <xenc:CipherValue>
                        gpfY28lxHoFyFvKtt/rlKMM7wCblZJ9Vgau12WaRFmuU3KulwmdiKnoOi+t9ueUFWSZEhOvedox2GU6iL63mtUnsXoVrTAnzRzGGlfpl+24RTruSxmVs6kDdSAVBloZiCeMXQYEzDU8lHgNTLxqs39gccKMQuhegxOP9jNIc+6Nqpai7t+5Udm5FzMC0umfforNCJWbTblheYHSpxDrH6hnhz+WKY9fIBvUpzZPpGMVwgLBxPM7OAgFr0ldNZZO189NzLgz+FCIZc74JlDujUvkh2aOAJa71UTJkb1JJHlyqTefUwe4Jdoely0cCr8uH+fSsrPNCNdedSaG0GZdVZg==
                    </xenc:CipherValue>
                </xenc:CipherData>
                <xenc:ReferenceList>
                    <xenc:DataReference URI="#ED-b879e495-a692-484a-ab0c-47baada954f8"/>
                </xenc:ReferenceList>
            </xenc:EncryptedKey>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-fddadc99-3625-482c-abb2-04de514156ca">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/>
                    </ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#id-137450fa-b74a-456a-ae6b-d8d7daa98ecb">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                                                        PrefixList=""/>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>EKuIqjWQ6jZKBeVZyZZmsyLxQc4=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>
                    exHuUijVopKPx6a6wZ7tvGl6V97i6S0QMP8BxF2At5AxPGsB4MyMbY8ViIZaUFM50qATseI8CmAdRBt4tN8WnlGLaQBgYOjoBRIJkbGp5akWNJyv/WCXZrRtcdWj52w4o/Xk2R2hb1Y/Hurzi17tJ0gfh55N4JFH7pk7FrzKDS4D6j9jjLyiif0Lm3gkxQDTZlbwa36VAMmuLGIeC0SeL1jV0Ro3QuhagjUIUyfsAOoVT+iMeCMFLB+cUj1HVV7PCNqANZU5klPf+H8mrq++Dngfp+2Ifkw3KfZzIQdsBARgfFPLb8riKek+kglYnoNPgX91u9GHociiYCWEmMcqcw==
                </ds:SignatureValue>
                <ds:KeyInfo Id="KI-4db52606-0cfd-4728-8842-3c0dd6d07a3d">
                    <wsse:SecurityTokenReference wsu:Id="STR-9340f8a2-27da-4c16-8b25-6ad9e09ae261">
                        <ds:X509Data>
                            <ds:X509IssuerSerial>
                                <ds:X509IssuerName>CN=server</ds:X509IssuerName>
                                <ds:X509SerialNumber>475205160</ds:X509SerialNumber>
                            </ds:X509IssuerSerial>
                        </ds:X509Data>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
               wsu:Id="id-137450fa-b74a-456a-ae6b-d8d7daa98ecb">
        <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-b879e495-a692-484a-ab0c-47baada954f8"
                            Type="http://www.w3.org/2001/04/xmlenc#Content">
            <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <wsse:SecurityTokenReference
                        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                        xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
                        wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
                    <wsse:Reference URI="#EK-eb7afb75-152f-4143-8eed-62933f7e32fc"/>
                </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
                <xenc:CipherValue>
                    5TUm2IL124KTbxCe1YPoPwzq/wvDZLl2zASZK9ve2ORIfowDFqZgxzmJ20UY55FePtMdi66JhOC35SME6VIMhzjzJlMqgPxRKRu6ZxvlFnSDVxzf4D4CAold7ZRH4ABJZQGfl9fpgfZyFwDdxjw72WCmUhIQkv+SpvqfW4YSi5OLJAalmGj3EvngHXQeZm8RexV9zRKLWQzbFa2mgPx5XQ==
                </xenc:CipherValue>
            </xenc:CipherData>
        </xenc:EncryptedData>
    </soap:Body>
</soap:Envelope>